app/Http/Controllers/ProjectController.php

insert into `projects` (`name`, `hashkey`, `status`, `updated_at`, `created_at`) values ('lloovvee..', 'lloovvee..', 1, '2021-06-27 11:07:12', '2021-06-27 11:07:12')
---
    public function create(Request $request, $project_name)
    {
        $hash_key = substr(Crypt::encryptString($project_name),5,10);
        $project = new Project;
        $project->name = $project_name;
        $project->hashkey = $hash_key;
        $project->status = 1;
        $project->save();

select * from `projects` where `hashkey` = 'iI6Ij' limit 1
select * from `resources` where `project_id` = 4
select * from `projects` order by `updated_at` desc
---
    public function project($hash) {
        $project = Project::where("hashkey", "=", $hash)->first();
        $resources = Resource::where("project_id", "=", $project->id)->get();
        //dd($resources);
        $projects = Project::orderBy("updated_at", "desc")->get();